content/posts/all-posts.md
+++
author = ["jeanjayquitayen"]
draft = false
+++

## Tutorials <span class="tag"><span class="_Tutorials">@Tutorials</span></span> {#tutorials}


### <span class="org-todo todo STARTED">STARTED</span> Testing Network Speed <span class="tag"><span class="networks">networks</span></span> {#my-first-post}

We all know how it feels when the network speed is problematic and you constantly get disconnected from the internet.

There are several approach to testing a network depending on the nature of it. Common factors are your ISP's internet speed or you local network.


#### Testing the Internet Speed {#testing-the-internet-speed}

There are serveral browser based speedtest tools that can be used to check you internet speed.
 The most commonly used is the speedtest.net.


### <span class="org-todo todo TODO">TODO</span> What you need to know about internet speedtest tools. {#what-you-need-to-know-about-internet-speedtest-tools-dot}


### <span class="org-todo todo TODO">TODO</span> Convert you PLDT Prepaid Modem into an Access Point. {#convert-you-pldt-prepaid-modem-into-an-access-point-dot}


### <span class="org-todo todo TODO">TODO</span> Set up a wifi voucher system using Tplink Omada. {#set-up-a-wifi-voucher-system-using-tplink-omada-dot}


### <span class="org-todo todo TODO">TODO</span> Django Token Authentication using Durin {#django-token-authentication-using-durin}


### <span class="org-todo todo TODO">TODO</span> How to use Multipass {#how-to-use-multipass}


### <span class="org-todo done DONE">DONE</span> Testing Django Rest API with Pytest {#Unittesting-with-drf}

If you are wondering how to use pytest with Django DRF then you are in for some treat.
Pytest is great for unit testing but when working with DRF some work needs to be done.
Luckily there is `drf_pytest` to help with structuring the test cases.


#### Project Setup {#project-setup}

We will be using the Django blog project for the tutorial.

```sh
django-admin start project blog
```


## Articles <span class="tag"><span class="_Articles">@Articles</span></span> {#articles}


### <span class="org-todo todo TODO">TODO</span> My second post <span class="tag"><span class="hugo">hugo</span></span> {#my-second-post}


#### The life of an Engineer {#the-life-of-an-engineer}

Their life started okay.


### <span class="org-todo todo TODO">TODO</span> Using RFC 6349 for Network Testing <span class="tag"><span class="networks">networks</span></span> {#TCP-Network-measurement}

When we talk about testing the network speed it is always the web browser based speed measurement tools like Ookla or Fast.com. These tools will give you the download and upload speed as well as the latency and ping.

{{< katex >}}

\\(f(a,b,c) = (a^2+b^2+c^2)^3\\)

% KaTeX inline notation

Inline notation: \\\\(\varphi = \dfrac{1+\sqrt5}{2}= 1.6180339887…\\\)


## Projects <span class="tag"><span class="_Projects">@Projects</span></span> {#projects}


### Aquarium Automatic Water Change {#aquarium-automatic-water-change}
